const sections_ru = {
  games: [
    {
      id: 1,
      image: "https://upload.wikimedia.org/wikipedia/ky/6/64/Atchabysh.jpg",
      title: "Ат Чабыш",
      description: "'Ат чабыш' — это увлекательная игра, которая объединяет участников в дружеские состязания. Она сочетает в себе элементы ловкости, стратегии и соперничества, что делает её захватывающим зрелищем для участников и зрителей. В игре используются специальные камни, каждый из которых имеет свои особенности и характеристики, что добавляет разнообразия и интереса в игровой процесс.",
      rules: "Правила игры 'Ат чабыш' довольно просты, но требуют от игроков сноровки и точности. Игра проводится на специальном игровом поле, которое обычно выделено на земле или на льду. Участники бросают свои камни в сторону цели, пытаясь попасть в неё или вытолкнуть камни соперников. Побеждает тот, кто набирает наибольшее количество очков или выполняет определенные задачи в игре.    ",
      history: "Игра 'Ат чабыш' имеет древние корни и является одним из символов кыргызской культуры. Её история уходит в глубокое прошлое, в те времена, когда камни, используемые в игре, служили как орудия охоты и защиты. С течением времени эти камни стали использоваться в различных игровых формах, включая и 'Ат чабыш'.    ",
      video: "https://www.youtube.com/embed/Pei2JZmssqg",
    },
    {
      id: 2,
      image: "https://vesti.kg/images/IMG__0116.jpg",
      title: "Жорго-Салыш: Игра с Камнями",
      description: "Жорго-Салыш - это традиционная кыргызская игра, в которой используются специальные камни для достижения цели или вытеснения камней соперников из игрового поля. Эта игра является не только спортивным соревнованием, но и частью культурного наследия Киргизии, сочетающим в себе ловкость, стратегию и соперничество.",
      rules: "Игра проводится на специальном игровом поле, обычно на земле или на льду. Участники по очереди бросают свои камни в сторону цели, стараясь попасть в неё или вытолкнуть камни соперников из игрового поля. Побеждает тот, кто сумеет набрать больше очков или выполнить определенные задачи в игре.",
      history: "Жорго-Салыш имеет глубокие исторические корни, уходящие в древние времена. В древности камни, используемые в игре, служили не только для развлечения, но и как орудия для охоты и защиты. Со временем эти камни стали использоваться в различных играх, включая Жорго-Салыш. Игра стала символом традиционного кыргызского образа жизни, сохраняя свою популярность среди местного населения и привлекая внимание и интерес со стороны туристов и исследователей культуры Киргизии.",
      video: "https://www.youtube.com/embed/WcDo6JuXM3s",
    },
    {
      id: 3,
      image: "https://sun9-43.userapi.com/impf/c631220/v631220277/4fa63/SfypxaychRs.jpg?size=604x402&quality=96&sign=0817cd062eb987d4fe7fff17cf8c3774&type=album",
      title: "Улак-Тарыш: Игра на Ослах",
      description: "Улак-Тарыш - это традиционная кыргызская игра, которая проводится на специальном игровом поле с использованием осла в качестве игровой фишки. Эта уникальная игра сочетает в себе элементы стратегии, ловкости и соперничества, предлагая игрокам и зрителям захватывающее развлечение.",
      rules: "Игроки разбиваются на команды и соревнуются в том, чтобы захватить осла соперника или защитить своего. Осел представляет собой игровую фишку, которую игроки двигают по игровому полю, используя свои стратегические навыки и ловкость. Побеждает та команда, которая сумеет захватить осла соперника и добраться с ним до своей конечной зоны.",
      history: "Улак-Тарыш имеет глубокие корни в кыргызской культуре и истории. Эта игра развивалась на протяжении многих веков и стала неотъемлемой частью кыргызской традиционной жизни. В древности осел играл важную роль в хозяйственной и культурной жизни кыргызского народа, и Улак-Тарыш был одним из способов взаимодействия с этим животным. С течением времени игра стала символом кыргызской национальной идентичности, продолжая радовать поклонников и привлекать новых участников.",
      video: "https://www.youtube.com/embed/he5PDkTPkHs",
    },
    {
      id: 4,
      image: "https://www.open.kg/uploads/posts/2014-02/1393529731_vlad-ushakov-photo.kg-60.jpg",
      title: "Оодарын: Игра с Шайбами",
      description: "Оодарын - это традиционная кыргызская игра, которая проводится на специальном игровом поле с использованием шайб в качестве игровых фишек. Эта игра сочетает в себе элементы ловкости, стратегии и соперничества, создавая захватывающее развлечение для участников и зрителей.",
      rules: "Участники игры разбиваются на команды и соревнуются в том, чтобы забросить шайбу в ворота соперника, используя клюшки. Команды пытаются защищать свои ворота и одновременно атаковать ворота соперника, стремясь забросить как можно больше шайб. Побеждает та команда, которая набирает наибольшее количество очков за игру.",
      history: "Оодарын имеет глубокие корни в кыргызской культуре и истории. Эта игра развивалась в течение многих поколений и стала неотъемлемой частью традиционного образа жизни кыргызского народа. С течением времени игра стала символом национальной идентичности Киргизии, продолжая радовать поклонников и привлекать новых участников своим захватывающим характером и атмосферой соперничества.",
      video: "",
    },
    {
      id: 5,
      image: "https://24.kg/files/media/40/40825.jpg",
      title: "Тыйын Энмей: игра с монетами",
      description: "Тыйын Энмей - это древняя игра, которая игралась в Киргизии веками. В ней используются монеты и стратегия для достижения победы. Эта игра не только развлекательная, но и позволяет развивать логическое мышление и тактические навыки.",
      rules: "Играют два участника. Каждый участник имеет набор из нескольких монет. Они поочерёдно бросают монеты на поверхность, на которой проводится игра, стараясь покрыть как можно большую площадь, но при этом оставаясь в пределах отведённого поля. Побеждает тот, кто закрывает больше площади или вытесняет монеты противника.",
      history: "Тыйын Энмей имеет глубокие корни в кыргызской культуре. Она восходит к древним временам, когда монеты использовались в различных аспектах повседневной жизни. Эта игра была не только развлечением, но и способом развития ловкости и тактических навыков участников. С течением времени она стала символом кыргызской традиции и национальной идентичности.",
      video: "",
    },
    {
      id: 6,
      image: "https://lh4.googleusercontent.com/proxy/ov-mrghl_b7keYU-imx1fNQDfmjz870yaF6Kr_eSg13ssi7v2N66vnQ5PHx_7eVyCqV78P_la_Bhd_yFbIlg8waMtyr9TLeF4n3Eo7DoV1Uvp-Ks20eKMUl4lly3",
      title: "Кыз куумай: игра с платками",
      description: "Кыз куумай - это игра, в которой участвуют два участника, обычно девушки. Она символизирует свадебную традицию и предполагает использование платков. Эта игра является не только развлечением, но и способом отображения мастерства и эмоционального выражения.",
      rules: "В игре одна из участниц прикрывает лицо платком и пытается уйти от другой, которая пытается снять платок. Побеждает та, кто первым снимает платок или преодолевает определенное расстояние без быть пойманным.",
      history: "Кыз куумай является частью традиционной кыргызской свадебной церемонии и символизирует момент встречи молодоженов. Эта игра имеет глубокие исторические корни и отражает культурные ценности и обычаи кыргызского народа.",
      video: "",
    },
    {
      id: 7,
      image: "https://st-1.akipress.org/st_runews/.storage/limon3/images/october2018/f14dddbda4073a179eb2aa1c1c7375d2.jpg",
      title: "Жамбы атмай: игра с камнями",
      description: "Жамбы атмай - это традиционная кыргызская игра, также известная как 'Стрельба в мишень с коня на скаку'. В этой игре участник, находясь на коне в движении, должен выстрелом из лука перебить нитку и сбить жамбы - драгоценность, которая подвешивается в качестве приза к наклонно вкопанной жерди.",
      rules: "Участник на коне стремится попасть из лука в нитку, чтобы сбить жамбы с жерди. Побеждает тот, кто сможет сделать это с наибольшей точностью и ловкостью во время движения/",
      history: "Жамбы атмай - это старинная кыргызская игра, которая имеет глубокие корни в культуре и традициях кыргызского народа. Она возникла как способ показать мастерство владения луком и стрельбы с коня на скаку, а также как развлекательное соревнование среди народа. Эта игра продолжает быть популярной в современном Кыргызстане и является важной частью его культурного наследия.",
      video: "",
    },
    {
      id: 8,
      image: "https://sputnik.kg/img/103293/09/1032930918_156:0:2648:1869_1400x0_80_0_0_f20e1b0311e2e297635a7589e4bd1df3.jpg",
      title: "Курош: Борьба",
      description: "Курош - это традиционный вид борьбы, который практикуется в Киргизии с древних времён. В этой игре участвуют два борца, которые пытаются свергнуть соперника на землю, используя различные приемы и техники.",
      rules: "Борцы стоят напротив друг друга и стараются свергнуть соперника на землю, используя приемы борьбы. Они могут использовать различные приемы, включая хватки и маневры, чтобы добиться победы. Побеждает тот, кто остается стоять или свергает всех своих соперников.",
      history: "Курош имеет древние корни и является частью кыргызской культуры и традиции. Эта игра была популярна среди кыргызского народа в течение многих веков и была передана из поколения в поколение как часть культурного наследия Киргизии.",
      video: "",
    },
    {
      id: 9,
      image: "https://st-1.akipress.org/127/.storage/limon2/images/july2017/728bf78439a33fe4e511aa543cd7de95.jpg",
      title: "Селкинчек: игра в кости",
      description: "Селкинчек - это традиционная кыргызская игра, которая играется с использованием специальных костей. Эта игра представляет собой смесь удачи и стратегии, и участники должны использовать свои навыки, чтобы добиться победы.",
      rules: "Участники бросают кости на поверхность, на которой проводится игра, стараясь достичь определенных комбинаций. В зависимости от комбинации, игроки получают очки или выполняют определенные действия. Побеждает тот, кто набирает наибольшее количество очков или выполняет определенные задачи в игре.",
      history: "Селкинчек имеет древние корни и был популярен среди кыргызского народа в течение многих веков. Эта игра была не только развлечением, но и способом общения и социализации в обществе. С течением времени она стала частью кыргызской культурной традиции и национальной идентичности.",
      video: "",
    },
    {
      id: 10,
      image: "https://static.tildacdn.com/tild6662-6635-4534-b033-363664323861/___.jpg",
      title: "Куш салуу: игра на лошадях",
      description: "Куш салуу - это традиционная кыргызская игра, в которой две команды сражаются на лошадях, пытаясь забросить мяч в ворота противника. Каждая команда состоит из нескольких наездников, которые используют свои лошади для передвижения по полю и атаки соперника. Игра требует высокой ловкости и координации как у участников, так и у их лошадей.",
      rules: "Игра проводится на специальном поле, разделенном на две части. Участники должны использовать клюшки, чтобы забросить мяч в ворота соперника. Побеждает команда, которая забьет больше голов.",
      history: "Куш салуу имеет древние корни и является неотъемлемой частью кыргызской культурной традиции. Эта игра возникла в эпоху кочевничества и отражает навыки и смелость кыргызских наездников. В прошлом игра служила не только развлечением, но и способом тренировки боевых навыков на коне.",
      video: "",
    },
    {
      id: 11,
      image: "https://lh4.googleusercontent.com/proxy/VPYArGNXv5v2o6_rk-zHH3HSnkNXyADoYettOqZh8W_tcTz5HYUzNSWa_K9qPUEzpfcHjjK54cbffABxfhmbykpUkC19iBGAki-TmobXNQedeDDpjD4s4CAsAgPqVnUFuJ3n4-0VNygbq6U4",
      title: "Сармерден: кыргызская игра",
      description: "Сармерден - это традиционная кыргызская игра, в которой два участника соревнуются, перемещая фишки по специальной игровой доске. Эта игра требует стратегического мышления и умения предугадывать ходы противника. Игроки ведут борьбу за захват фишек противника, используя тактические ходы и блокировки для достижения своих целей.",
      rules: "Игроки перемещают свои фишки по игровой доске с целью захвата фишек противника. Побеждает тот, кто первым захватит определенное количество фишек. Игра ведется до тех пор, пока один из игроков не достигнет победного условия, либо до исчерпания ходов.",
      history: "Сармерден имеет глубокие исторические корни и был популярен среди кыргызского народа в течение многих веков. Эта игра служила не только развлечением, но и способом развития стратегического мышления и логики у игроков. В традиционной кыргызской культуре игра Сармерден занимает особое место как символ ума и интеллекта.",
      video: "",
    },
  ],
  traditions: [
    {
      id: 1,
      image: "https://i.ytimg.com/vi/W8vOF1_35Bg/hq720.jpg?sqp=-oaymwE7CK4FEIIDSFryq4qpAy0IARUAAAAAGAElAADIQj0AgKJD8AEB-AHUBoAC4AOKAgwIABABGHIgTChEMA8=&rs=AOn4CLALMlucOogFqPKjZqXX-eLrCetu2Q",
      title: "Упай Ордо",
      description: "Упай Ордо - это традиционный кыргызский обед, который готовится и подается в честь торжественных событий, таких как свадьбы, гулянья и праздники. Он включает в себя разнообразные блюда из мяса, овощей и традиционного лепешечного хлеба. Этот обед является символом гостеприимства и дружелюбия к гостям, поэтому его приготовление часто ассоциируется с особым уходом и вниманием к деталям. Традиционные блюда, представленные на Упай Ордо, являются неотъемлемой частью культуры и кулинарного наследия Кыргызстана.",
      rules: "",
      history: "Традиция Упай Ордо имеет древние корни в культуре кыргызского народа. Ее возникновение связано с древними обычаями и обрядами, которые с течением времени превратились во важную составляющую национальной культуры. В прошлом Упай Ордо был не только символом гостеприимства, но и способом общения и укрепления взаимоотношений между людьми. С течением времени эта традиция сохранилась и стала неотъемлемой частью праздничной культуры Кыргызстана, продолжая радовать и восхищать своим разнообразием блюд и атмосферой радушия.",
      video: "",
    },
    {
      id: 2,
      image: "https://www.advantour.com/img/kyrgyzstan/holidays/nooruz6.jpg",
      title: "Нооруз",
      description: "Нооруз - это традиционный кыргызский новый год, который отмечается весной и является одним из самых важных праздников в культуре страны. Он связан с празднованием природы, обновления и обновления жизни. В этот день люди собираются вместе с семьей и друзьями, чтобы отметить начало нового года и провести время весело и радостно.",
      rules: "",
      history: "Празднование Нооруза имеет древние корни и связано с зороастризмом, античной религией, практикуемой в древней Персии. С течением времени этот праздник стал неотъемлемой частью культуры и традиций Кыргызстана. Нооруз отмечает начало весны и нового года в исламском календаре и символизирует обновление, обновление и возрождение. Важными элементами празднования являются раскладывание новогоднего стола, поздравления, обмен подарками и проведение различных национальных обрядов и обычаев.",
      video: ""
    },
    {
      id: 3,
      image: "https://24.kg/files/media/220/220236.jpg",
      title: "Орозо Айт, Курман Айт",
      description: "Орозо Айт и Курман Айт - это два из самых важных религиозных праздников в исламе, отмечаемые мусульманами в Кыргызстане. Орозо Айт отмечает завершение месяца Рамадан, а Курман Айт - конец праздника. В эти дни мусульмане собираются вместе с семьей и друзьями, чтобы отметить окончание священного месяца поста и празднование радостного события.",
      rules: "",
      history: "Орозо Айт и Курман Айт имеют глубокие религиозные корни и отмечаются с соблюдением традиционных обрядов и обычаев. Орозо Айт - это время радости и благодарности за окончание поста и возможность отметить этот момент вместе с близкими. Курман Айт, или праздник жертвоприношения, связан с историей Ибрагима и его готовностью принести в жертву сына, что символизирует веру и преданность Богу.",
      video: ""
    },
    {
      id: 4,
      image: "https://anhor.uz/wp-content/uploads/2024/03/1622723786_mceu_43022856831622723781723.jpg",
      title: "Дан тушум майрамы",
      description: "Дан тушум майрамы - это традиционный кыргызский праздник, который отмечается в честь окончания мусульманского поста месяца Рамазан. Во время этого праздника семьи и друзья собираются вместе, чтобы отметить радостное событие. Они готовят традиционные блюда и проводят время в кругу близких.",
      rules: "",
      history: "Дан тушум майрамы имеет древние корни и отмечается мусульманами в Кыргызстане с соблюдением традиционных обрядов и обычаев. Праздник символизирует окончание месяца поста и радостное возвращение к обычной жизни. Во время дан тушум майрамы люди делятся радостью и благополучием с близкими, а также помнят о нуждающихся, оказывая им помощь и поддержку.",
      video: ""
    }
  ]
}

const sections = {
  ru: sections_ru,
  kg: 'kg',
  en: 'en',
}

let btns = document.querySelectorAll('#btns button');
if (localStorage.getItem('language') == null) {
  localStorage.setItem('language', 'ru');
}
btns.forEach(btn => {
  btn.addEventListener('click', (e) => {
    localStorage.setItem('language', e.target.textContent);
    localStorage.setItem('sections', JSON.stringify(sections[e.target.textContent.toLowerCase()]));
    window.location.reload();
  });
});
